Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_primary_school/index.html.txt.tmx
Source language: en
Languages: ga

source: Going to primary school
ga: Dul chun na bunscoile

source: Life Event Document Starting school Find out what is involved when starting school at primary level
ga: Life Event Document Tosú ar scoil Tugann an doiciméad seo cur síos ar an gcóras oideachais bhunscolaíochta in Éirinn

source: This document describes who owns primary schools and how they are funded
ga: Déanann an cháipéis seo cur síos ar úinéireacht bunscoileanna agus an chaoi a bhfuil siad maoinithe

source: Curriculum in primary schools
ga: An curaclam sna bunscoileanna

source: An outline of the primary school curriculum, including its aims, structure and content
ga: Achoimre ar an gcuraclam bunscoile, ag cur san áireamh aidhmeanna, struchtúr agus ábhar

source: Boards of management in primary schools
ga: Boird bhainistíochta i mbunscoileanna

source: This document describes the rules governing boards of management of primary schools
ga: Tá cur síos anseo ar na rialacha a bhaineann le boird bhainistíochta i mbunscoileanna

source: Who owns primary schools and how they are they funded?
ga: Tá cur síos anseo ar cé leo na bunscoileanna agus conas a mhaoinítear iad

source: Tackling disadvantage in primary schools
ga: Ag dul i ngleic le míbhuntáiste i mbunscoileanna

source: Describes schemes that provide additional resources for primary schools with large numbers of disadvantaged pupils
ga: Tá go leor scéimeanna a thugann breis acmhainní do bhunscoileanna le líon mór páistí faoi mhíbhuntáiste

source: Special needs education in primary schools
ga: Oideachas riachtanas speisialta i mbunscoileanna

source: The arrangements for special needs education in primary schools include learning support/resource teachers and special needs assistants
ga: Cuimsíonn na socruithe d’oideachas riachtanas speisialta i mbunscoileanna múinteoirí tacaíochta foghlama/múinteoirí acmhainne agus cúntóirí riachtanas speisialta

source: Primary school transport scheme
ga: An scéim iompair bhunscoile

source: The transport scheme for primary school pupils and information on how to qualify
ga: Déantar cur síos ar an scéim iompair bhunscoile agus na coinníollacha a bhaineann leí

source: School transport for children with special needs
ga: Iompar scoile do ghasúir le riachtanais speisialta

source: Children who are enrolled in State special schools or in special classes in State primary schools may qualify for free transport to school
ga: Is féidir le gasúir atá ar an rolla i Scoileanna Speisialta Stáit nó i Ranganna Speisialta i mBunscoileanna Stáit bheith i dteideal iompar saor in aisce a fháil idir an baile agus an scoil

source: Organisations and resources for primary schools
ga: Eagraíochtaí agus acmhainní do bhunscoileanna

source: Outlines organisations and internet resources providing information on education at primary level
ga: Cur síos ar eagraíochtaí agus na hacmhainní Idirlín a thugann faisnéis faoin mbunoideachas

source: Moving your children to primary school
ga: Do pháiste a aistriú chuig bunscoil in Éirinn

source: Introduces the system of education in Ireland at primary level and information describes the procedures involved in enrolling a child in primary school
ga: Tá cur síos anseo ar an gcóras bunscolaíochta in Éirinn agus eolas ar na córais iarratais a bhaineann leo agus ar do pháiste a chur chuig do rogha scoil

source: This document is in: Moving Country > Moving to Ireland > Introduction to the Irish System
ga: This document is in: Ag bogadh tíre > Teacht go hÉirinn > Tús eolais ar chóras na hÉireann

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Táillí do scoláirí tríú leibhéal
